class MytripsController < ApplicationController

	def new
		@mytrip = Mytrip.new
		@user = current_user
		@country_list = [["タジキスタン","TI"],["ジャマイカ","JM"],["ハイチ","HA"],["サントメ・プリンシペ","TP"],["モントセラト","MH"],
		["アラブ首長国連邦","AE"],["パキスタン","PK"],["オランダ","NL"],["ルクセンブルク","LU"],["ベリーズ","BH"],
		["イラン・イスラム共和国","IR"],["ボリビア","BL"],["ウルグアイ","UY"],["ガーナ","GH"],["サウジアラビア","SA"],
		["コートジボワール","IV"],["サンマルタン (仏領)","RN"],["フランス南方領土","FS"],["アングイラ","AV"],["カタール","QA"],
		["サンマルタン (オランダ領)","NN"],["リビア","LY"],["ブーベ島","BV"],["パプアニューギニア","PP"],["キルギスタン","KG"],
		["赤道ギニア","EK"],["西サハラ","WI"],["ニウエ","NE"],["プエルトリコ","RQ"],["グレナダ","GJ"],["大韓民国 (韓国)"],["KS"],
		["ハード島及びマクドナルド諸島","HM"],["サンマリノ","SM"],["シエラレオネ","SL"],["コンゴ民主共和国","CG"],["マケドニア共和国","MK"],
		["トルコ","TU"],["アルジェリア","AG"],["グルジア","GG"],["パレスチナ","WE"],["バルバドス","BB"],["ウクライナ","UP"],
		["グアドループ","GP"],["仏領ポリネシア","FP"],["ナミビア","WA"],["ボツワナ","BC"],["シリア・アラブ共和国","SY"],
		["トーゴ","TO"],["ドミニカ共和国","DR"],["南極大陸","AY"],["スイス","SZ"],["マダガスカル","MA"],["フェロー諸島","FO"],
		["英領ヴァージン諸島","VI"],["ジブラルタル","GI"],["ブルネイ・ダルサラーム国","BX"],["ラオス人民民主共和国","LA"],["アイスランド","IC"],
		["エストニア","EN"],["アメリカ合衆国外諸島","UM"],["リトアニア","LH"],["セルビア","RI"],["モーリタニア","MR"],["アンドラ","AN"],
		["ハンガリー","HU"],["トケラウ","TL"],["マレーシア","MY"],["アンゴラ","AO"],["カーボヴェルデ","CV"],["ノーフォーク島","NF"],
		["パナマ","PM"],["ギニアビサウ","PU"],["ベルギー","BE"],["ポルトガル","PO"],["イギリス","UK"],["マン島","IM"],
		["アメリカ合衆国","US"],["イエメン","YM"],["香港","HK"],["アゼルバイジャン","AJ"],["ココス (キーリング) 諸島","CK"],
		["スロバキア","LO"],["バヌアツ","NH"],["東ティモール","TT"],["クロアチア","HR"],["スリナム","NS"],["モーリシャス","MP"],
		["チェコ","EZ"],["サンピエール及びミクロン","SB"],["レソト","LT"],["サモア","WS"],["コモロ","CN"],["イタリア","IT"],
		["ブルンジ","BY"],["ワリー及びフテュナ","WF"],["ギニア","GV"],["シンガポール","SN"],["コロンビア","CO"],["中国","CH"],
		["アルーバ","AA"],["モロッコ","MO"],["フィンランド","FI"],["バチカン市国","VT"],["ジンバブエ","ZI"],["ケイマン諸島","CJ"],
		["バーレーン","BA"],["パラグアイ","PA"],["エクアドル","EC"],["リベリア","LI"],["ロシア連邦","RS"],["ポーランド","PL"],
		["オマーン","MU"],["マルタ","MT"],["南スーダン","OD"],["ドイツ","GM"],["トルクメニスタン","TX"],["スヴァールバル及びヤンマイエン","SV"],
		["ミャンマー","BM"],["トリニダード・トバゴ","TD"],["イスラエル","IS"],["バングラデシュ","BG"],["ナウル","NR"],["スリランカ","CE"],
		["ウガンダ","UG"],["ナイジェリア","NI"],["メキシコ","MX"],["キュラソー","UC"],["スロベニア","SI"],["モンゴル","MG"],
		["カナダ","CA"],["オーランド諸島","AX"],["ベトナム","VM"],["台湾","TW"],["日本","JA"],["英国インド洋領土","IO"],
		["ルーマニア","RO"],["ブルガリア","BU"],["グアム","GQ"],["ブラジル","BR"],["アルメニア","AM"],["ザンビア","ZA"],
		["ジャージー","JE"],["オーストリア","AU"],["カメルーン","CM"],["スウェーデン","SW"],["フィジー","FJ"],["カザフスタン","KZ"],
		["グリーンランド","GL"],["ガイアナ","GY"],["クリスマス島","KT"],["マラウイ","MI"],["チュニジア","TS"],["南アフリカ","SF"],
		["トンガ","TN"],["キプロス","CY"],["モルディブ","MV"],["ピトケアン","PC"],["ルワンダ","RW"],["ニカラグア","NU"],
		["セントクリストファー・ネーヴィス","SC"],["ベナン","BN"],["エチオピア","ET"],["ガンビア","GA"],["タンザニア","TZ"],
		["セントビンセント及びグレナディーン諸島","VC"],["フォークランド諸島 (マルビナス)","FK"],["スーダン","SU"],["モナコ","MN"],
		["オーストラリア","AS"],["チリ","CI"],["デンマーク","DA"],["フランス","FR"],["タークス及びカイコス諸島","TK"],["キューバ","CU"],
		["アルバニア","AL"],["モザンビーク","MZ"],["バハマ","BF"],["ニジェール","NG"],["グアテマラ","GT"],["リヒテンシュタイン","LS"],
		["ネパール","NP"],["ブルキナファソ","UV"],["パラオ","PS"],["クウェート","KU"],["インド","IN"],["ガボン","GB"],["ツバル","TV"],
		["マカオ","MC"],["セントヘレナ、アセンション及びトリスタン・ダ・クーニャ","SH"],["モルドバ","MD"],["クック諸島","CW"],["アルゼンチン","AR"],
		["セーシェル","SE"],["アイルランド","EI"],["スペイン","SP"],["レバノン","LE"],["バーミューダ","BD"],["レユニオン","RE"],
		["キリバス","KR"],["アンティグア・バーブーダ","AC"],["マルティニーク","MB"],["エルサルバドル","ES"],["ヨルダン","JO"],
		["ソマリア","SO"],["マーシャル諸島","RM"],["コンゴ","CF"],["朝鮮民主主義人民共和国","KN"],["仏領ギアナ","FG"],
		["ボスニア・ヘルツェゴビナ","BK"],["マヨット","MF"],["サウスジョージア及びサウスサンドウィッチ諸島","SX"],["ケニア","KE"],
		["ブータン","BT"],["スワジランド","WZ"],["コスタリカ","CS"],["チャド","CD"],["ドミニカ","DO"],["ニューカレドニア","NC"],
		["ギリシャ","GR"],["ガーンジー","GK"],["ホンジュラス","HO"],["米領ヴァージン諸島","VQ"],["中央アフリカ共和国","CT"],
		["アフガニスタン","AF"],["北マリアナ諸島","CQ"],["フィリピン","RP"],["ベラルーシ","BO"],["ラトビア","LG"],["ノルウェー","NO"],
		["エジプト","EG"],["カンボジア","CB"],["イラク","IZ"],["セントルシア","ST"],["ニュージーランド","NZ"],["サンバルテルミ","TB"],
		["ウズベキスタン","UZ"],["インドネシア","ID"],["エリトリア国","ER"],["ベネズエラ","VE"],["ミクロネシア連邦","FM"],["セネガル","SG"],
		["ソロモン諸島","BP"],["モンテネグロ","MJ"],["米領サモア","AQ"],["マリ","ML"],["タイ","TH"],["ペルー","PE"],["ジブチ","DJ"]]

	end


	def create
			@mytrip = Mytrip.new(mytrip_params)
			@user = current_user
			@mytrip.user_id  = @user.id
		if @mytrip.save
			redirect_to mytrip_path(@mytrip.id)
		else
			redirect_to new_mytrip_path
		end
	end

	def index
		@mytrips = Mytrip.all
		@mytrip = Mytrip.new
	  @user = current_user
	end

	def show
		@mytrip = Mytrip.find(params[:id])
		@user = current_user
		country_name = @mytrip.country
		@country = ISO3166::Country.new('US')
		@country_list = [["タジキスタン","TI"],["ジャマイカ","JM"],["ハイチ","HA"],["サントメ・プリンシペ","TP"],["モントセラト","MH"],
		["アラブ首長国連邦","AE"],["パキスタン","PK"],["オランダ","NL"],["ルクセンブルク","LU"],["ベリーズ","BH"],
		["イラン・イスラム共和国","IR"],["ボリビア","BL"],["ウルグアイ","UY"],["ガーナ","GH"],["サウジアラビア","SA"],
		["コートジボワール","IV"],["サンマルタン (仏領)","RN"],["フランス南方領土","FS"],["アングイラ","AV"],["カタール","QA"],
		["サンマルタン (オランダ領)","NN"],["リビア","LY"],["ブーベ島","BV"],["パプアニューギニア","PP"],["キルギスタン","KG"],
		["赤道ギニア","EK"],["西サハラ","WI"],["ニウエ","NE"],["プエルトリコ","RQ"],["グレナダ","GJ"],["大韓民国 (韓国)"],["KS"],
		["ハード島及びマクドナルド諸島","HM"],["サンマリノ","SM"],["シエラレオネ","SL"],["コンゴ民主共和国","CG"],["マケドニア共和国","MK"],
		["トルコ","TU"],["アルジェリア","AG"],["グルジア","GG"],["パレスチナ","WE"],["バルバドス","BB"],["ウクライナ","UP"],
		["グアドループ","GP"],["仏領ポリネシア","FP"],["ナミビア","WA"],["ボツワナ","BC"],["シリア・アラブ共和国","SY"],
		["トーゴ","TO"],["ドミニカ共和国","DR"],["南極大陸","AY"],["スイス","SZ"],["マダガスカル","MA"],["フェロー諸島","FO"],
		["英領ヴァージン諸島","VI"],["ジブラルタル","GI"],["ブルネイ・ダルサラーム国","BX"],["ラオス人民民主共和国","LA"],["アイスランド","IC"],
		["エストニア","EN"],["アメリカ合衆国外諸島","UM"],["リトアニア","LH"],["セルビア","RI"],["モーリタニア","MR"],["アンドラ","AN"],
		["ハンガリー","HU"],["トケラウ","TL"],["マレーシア","MY"],["アンゴラ","AO"],["カーボヴェルデ","CV"],["ノーフォーク島","NF"],
		["パナマ","PM"],["ギニアビサウ","PU"],["ベルギー","BE"],["ポルトガル","PO"],["イギリス","UK"],["マン島","IM"],
		["アメリカ合衆国","US"],["イエメン","YM"],["香港","HK"],["アゼルバイジャン","AJ"],["ココス (キーリング) 諸島","CK"],
		["スロバキア","LO"],["バヌアツ","NH"],["東ティモール","TT"],["クロアチア","HR"],["スリナム","NS"],["モーリシャス","MP"],
		["チェコ","EZ"],["サンピエール及びミクロン","SB"],["レソト","LT"],["サモア","WS"],["コモロ","CN"],["イタリア","IT"],
		["ブルンジ","BY"],["ワリー及びフテュナ","WF"],["ギニア","GV"],["シンガポール","SN"],["コロンビア","CO"],["中国","CH"],
		["アルーバ","AA"],["モロッコ","MO"],["フィンランド","FI"],["バチカン市国","VT"],["ジンバブエ","ZI"],["ケイマン諸島","CJ"],
		["バーレーン","BA"],["パラグアイ","PA"],["エクアドル","EC"],["リベリア","LI"],["ロシア連邦","RS"],["ポーランド","PL"],
		["オマーン","MU"],["マルタ","MT"],["南スーダン","OD"],["ドイツ","GM"],["トルクメニスタン","TX"],["スヴァールバル及びヤンマイエン","SV"],
		["ミャンマー","BM"],["トリニダード・トバゴ","TD"],["イスラエル","IS"],["バングラデシュ","BG"],["ナウル","NR"],["スリランカ","CE"],
		["ウガンダ","UG"],["ナイジェリア","NI"],["メキシコ","MX"],["キュラソー","UC"],["スロベニア","SI"],["モンゴル","MG"],
		["カナダ","CA"],["オーランド諸島","AX"],["ベトナム","VM"],["台湾","TW"],["日本","JA"],["英国インド洋領土","IO"],
		["ルーマニア","RO"],["ブルガリア","BU"],["グアム","GQ"],["ブラジル","BR"],["アルメニア","AM"],["ザンビア","ZA"],
		["ジャージー","JE"],["オーストリア","AU"],["カメルーン","CM"],["スウェーデン","SW"],["フィジー","FJ"],["カザフスタン","KZ"],
		["グリーンランド","GL"],["ガイアナ","GY"],["クリスマス島","KT"],["マラウイ","MI"],["チュニジア","TS"],["南アフリカ","SF"],
		["トンガ","TN"],["キプロス","CY"],["モルディブ","MV"],["ピトケアン","PC"],["ルワンダ","RW"],["ニカラグア","NU"],
		["セントクリストファー・ネーヴィス","SC"],["ベナン","BN"],["エチオピア","ET"],["ガンビア","GA"],["タンザニア","TZ"],
		["セントビンセント及びグレナディーン諸島","VC"],["フォークランド諸島 (マルビナス)","FK"],["スーダン","SU"],["モナコ","MN"],
		["オーストラリア","AS"],["チリ","CI"],["デンマーク","DA"],["フランス","FR"],["タークス及びカイコス諸島","TK"],["キューバ","CU"],
		["アルバニア","AL"],["モザンビーク","MZ"],["バハマ","BF"],["ニジェール","NG"],["グアテマラ","GT"],["リヒテンシュタイン","LS"],
		["ネパール","NP"],["ブルキナファソ","UV"],["パラオ","PS"],["クウェート","KU"],["インド","IN"],["ガボン","GB"],["ツバル","TV"],
		["マカオ","MC"],["セントヘレナ、アセンション及びトリスタン・ダ・クーニャ","SH"],["モルドバ","MD"],["クック諸島","CW"],["アルゼンチン","AR"],
		["セーシェル","SE"],["アイルランド","EI"],["スペイン","SP"],["レバノン","LE"],["バーミューダ","BD"],["レユニオン","RE"],
		["キリバス","KR"],["アンティグア・バーブーダ","AC"],["マルティニーク","MB"],["エルサルバドル","ES"],["ヨルダン","JO"],
		["ソマリア","SO"],["マーシャル諸島","RM"],["コンゴ","CF"],["朝鮮民主主義人民共和国","KN"],["仏領ギアナ","FG"],
		["ボスニア・ヘルツェゴビナ","BK"],["マヨット","MF"],["サウスジョージア及びサウスサンドウィッチ諸島","SX"],["ケニア","KE"],
		["ブータン","BT"],["スワジランド","WZ"],["コスタリカ","CS"],["チャド","CD"],["ドミニカ","DO"],["ニューカレドニア","NC"],
		["ギリシャ","GR"],["ガーンジー","GK"],["ホンジュラス","HO"],["米領ヴァージン諸島","VQ"],["中央アフリカ共和国","CT"],
		["アフガニスタン","AF"],["北マリアナ諸島","CQ"],["フィリピン","RP"],["ベラルーシ","BO"],["ラトビア","LG"],["ノルウェー","NO"],
		["エジプト","EG"],["カンボジア","CB"],["イラク","IZ"],["セントルシア","ST"],["ニュージーランド","NZ"],["サンバルテルミ","TB"],
		["ウズベキスタン","UZ"],["インドネシア","ID"],["エリトリア国","ER"],["ベネズエラ","VE"],["ミクロネシア連邦","FM"],["セネガル","SG"],
		["ソロモン諸島","BP"],["モンテネグロ","MJ"],["米領サモア","AQ"],["マリ","ML"],["タイ","TH"],["ペルー","PE"],["ジブチ","DJ"]]
	end

	def edit
		 @user = current_user
		 @mytrip = Mytrip.find(params[:id])
		 @country_list = [["タジキスタン","TI"],["ジャマイカ","JM"],["ハイチ","HA"],["サントメ・プリンシペ","TP"],["モントセラト","MH"],
		["アラブ首長国連邦","AE"],["パキスタン","PK"],["オランダ","NL"],["ルクセンブルク","LU"],["ベリーズ","BH"],
		["イラン・イスラム共和国","IR"],["ボリビア","BL"],["ウルグアイ","UY"],["ガーナ","GH"],["サウジアラビア","SA"],
		["コートジボワール","IV"],["サンマルタン (仏領)","RN"],["フランス南方領土","FS"],["アングイラ","AV"],["カタール","QA"],
		["サンマルタン (オランダ領)","NN"],["リビア","LY"],["ブーベ島","BV"],["パプアニューギニア","PP"],["キルギスタン","KG"],
		["赤道ギニア","EK"],["西サハラ","WI"],["ニウエ","NE"],["プエルトリコ","RQ"],["グレナダ","GJ"],["大韓民国 (韓国)"],["KS"],
		["ハード島及びマクドナルド諸島","HM"],["サンマリノ","SM"],["シエラレオネ","SL"],["コンゴ民主共和国","CG"],["マケドニア共和国","MK"],
		["トルコ","TU"],["アルジェリア","AG"],["グルジア","GG"],["パレスチナ","WE"],["バルバドス","BB"],["ウクライナ","UP"],
		["グアドループ","GP"],["仏領ポリネシア","FP"],["ナミビア","WA"],["ボツワナ","BC"],["シリア・アラブ共和国","SY"],
		["トーゴ","TO"],["ドミニカ共和国","DR"],["南極大陸","AY"],["スイス","SZ"],["マダガスカル","MA"],["フェロー諸島","FO"],
		["英領ヴァージン諸島","VI"],["ジブラルタル","GI"],["ブルネイ・ダルサラーム国","BX"],["ラオス人民民主共和国","LA"],["アイスランド","IC"],
		["エストニア","EN"],["アメリカ合衆国外諸島","UM"],["リトアニア","LH"],["セルビア","RI"],["モーリタニア","MR"],["アンドラ","AN"],
		["ハンガリー","HU"],["トケラウ","TL"],["マレーシア","MY"],["アンゴラ","AO"],["カーボヴェルデ","CV"],["ノーフォーク島","NF"],
		["パナマ","PM"],["ギニアビサウ","PU"],["ベルギー","BE"],["ポルトガル","PO"],["イギリス","UK"],["マン島","IM"],
		["アメリカ合衆国","US"],["イエメン","YM"],["香港","HK"],["アゼルバイジャン","AJ"],["ココス (キーリング) 諸島","CK"],
		["スロバキア","LO"],["バヌアツ","NH"],["東ティモール","TT"],["クロアチア","HR"],["スリナム","NS"],["モーリシャス","MP"],
		["チェコ","EZ"],["サンピエール及びミクロン","SB"],["レソト","LT"],["サモア","WS"],["コモロ","CN"],["イタリア","IT"],
		["ブルンジ","BY"],["ワリー及びフテュナ","WF"],["ギニア","GV"],["シンガポール","SN"],["コロンビア","CO"],["中国","CH"],
		["アルーバ","AA"],["モロッコ","MO"],["フィンランド","FI"],["バチカン市国","VT"],["ジンバブエ","ZI"],["ケイマン諸島","CJ"],
		["バーレーン","BA"],["パラグアイ","PA"],["エクアドル","EC"],["リベリア","LI"],["ロシア連邦","RS"],["ポーランド","PL"],
		["オマーン","MU"],["マルタ","MT"],["南スーダン","OD"],["ドイツ","GM"],["トルクメニスタン","TX"],["スヴァールバル及びヤンマイエン","SV"],
		["ミャンマー","BM"],["トリニダード・トバゴ","TD"],["イスラエル","IS"],["バングラデシュ","BG"],["ナウル","NR"],["スリランカ","CE"],
		["ウガンダ","UG"],["ナイジェリア","NI"],["メキシコ","MX"],["キュラソー","UC"],["スロベニア","SI"],["モンゴル","MG"],
		["カナダ","CA"],["オーランド諸島","AX"],["ベトナム","VM"],["台湾","TW"],["日本","JA"],["英国インド洋領土","IO"],
		["ルーマニア","RO"],["ブルガリア","BU"],["グアム","GQ"],["ブラジル","BR"],["アルメニア","AM"],["ザンビア","ZA"],
		["ジャージー","JE"],["オーストリア","AU"],["カメルーン","CM"],["スウェーデン","SW"],["フィジー","FJ"],["カザフスタン","KZ"],
		["グリーンランド","GL"],["ガイアナ","GY"],["クリスマス島","KT"],["マラウイ","MI"],["チュニジア","TS"],["南アフリカ","SF"],
		["トンガ","TN"],["キプロス","CY"],["モルディブ","MV"],["ピトケアン","PC"],["ルワンダ","RW"],["ニカラグア","NU"],
		["セントクリストファー・ネーヴィス","SC"],["ベナン","BN"],["エチオピア","ET"],["ガンビア","GA"],["タンザニア","TZ"],
		["セントビンセント及びグレナディーン諸島","VC"],["フォークランド諸島 (マルビナス)","FK"],["スーダン","SU"],["モナコ","MN"],
		["オーストラリア","AS"],["チリ","CI"],["デンマーク","DA"],["フランス","FR"],["タークス及びカイコス諸島","TK"],["キューバ","CU"],
		["アルバニア","AL"],["モザンビーク","MZ"],["バハマ","BF"],["ニジェール","NG"],["グアテマラ","GT"],["リヒテンシュタイン","LS"],
		["ネパール","NP"],["ブルキナファソ","UV"],["パラオ","PS"],["クウェート","KU"],["インド","IN"],["ガボン","GB"],["ツバル","TV"],
		["マカオ","MC"],["セントヘレナ、アセンション及びトリスタン・ダ・クーニャ","SH"],["モルドバ","MD"],["クック諸島","CW"],["アルゼンチン","AR"],
		["セーシェル","SE"],["アイルランド","EI"],["スペイン","SP"],["レバノン","LE"],["バーミューダ","BD"],["レユニオン","RE"],
		["キリバス","KR"],["アンティグア・バーブーダ","AC"],["マルティニーク","MB"],["エルサルバドル","ES"],["ヨルダン","JO"],
		["ソマリア","SO"],["マーシャル諸島","RM"],["コンゴ","CF"],["朝鮮民主主義人民共和国","KN"],["仏領ギアナ","FG"],
		["ボスニア・ヘルツェゴビナ","BK"],["マヨット","MF"],["サウスジョージア及びサウスサンドウィッチ諸島","SX"],["ケニア","KE"],
		["ブータン","BT"],["スワジランド","WZ"],["コスタリカ","CS"],["チャド","CD"],["ドミニカ","DO"],["ニューカレドニア","NC"],
		["ギリシャ","GR"],["ガーンジー","GK"],["ホンジュラス","HO"],["米領ヴァージン諸島","VQ"],["中央アフリカ共和国","CT"],
		["アフガニスタン","AF"],["北マリアナ諸島","CQ"],["フィリピン","RP"],["ベラルーシ","BO"],["ラトビア","LG"],["ノルウェー","NO"],
		["エジプト","EG"],["カンボジア","CB"],["イラク","IZ"],["セントルシア","ST"],["ニュージーランド","NZ"],["サンバルテルミ","TB"],
		["ウズベキスタン","UZ"],["インドネシア","ID"],["エリトリア国","ER"],["ベネズエラ","VE"],["ミクロネシア連邦","FM"],["セネガル","SG"],
		["ソロモン諸島","BP"],["モンテネグロ","MJ"],["米領サモア","AQ"],["マリ","ML"],["タイ","TH"],["ペルー","PE"],["ジブチ","DJ"]]
		if @mytrip.user.id != current_user.id
     redirect_to mytrip_path(mytrip.id)
   end
	end

	def update
		 @mytrip = Mytrip.find(params[:id])
  if @mytrip.update(mytrip_params)
  		redirect_to mytrips_path, notice: "successfully updated book!"
  	else
  		render "edit"
  	end
	end

	def destroy
		@mytrip = Mytrip.find(params[:id])
  	@mytrip.destoy
  	redirect_to mytrips_path, notice: "successfully delete book!"
	end


	private
	def mytrip_params
		params.require(:mytrip).permit(:name,:gender,:age,:image,:countory,:time_difference,:climate,:month,:season,:security,:prices,:traffic,:flight_time,:airline,:airline_comment,:with_whom,:days,:total_price,:bathroom,:card,:tip,:language,:must,:good_point,:bad_point,:important,:address,:area,:latitude,:longitude)
	end

end
